{
  "2nd_year_cse": {
    "title": "Yellow House Questions",
    "description": "Problem Statements for Students of 2nd Year CSE and CSBS Students.",
    "questions": [
      {
        "id": 1,
        "statement": "Design an IoT-based smart home system to automatically control lighting, heating, and security via a mobile app.",
        "description": "Develop a comprehensive home automation solution that integrates multiple IoT devices to create an intelligent living environment. The system should include smart switches for lighting control, temperature sensors and smart thermostats for heating management, and security components like door/window sensors and cameras. The mobile application should provide an intuitive interface for remote monitoring and control, allowing users to set schedules, create automation rules, and receive real-time notifications. Consider implementing energy efficiency algorithms and user preference learning capabilities."
      },
      {
        "id": 2,
        "statement": "Develop an IoT attendance system for classrooms using RFID or Bluetooth beacons to log student entry and exit.",
        "description": "Create an automated attendance tracking system that eliminates manual roll calls and reduces administrative overhead. The solution should use RFID cards or Bluetooth Low Energy (BLE) beacons to detect student presence when they enter or exit the classroom. Implement a database to store attendance records, generate reports, and provide analytics on attendance patterns. The system should handle multiple students simultaneously, prevent proxy attendance, and include a web dashboard for teachers to view real-time attendance data and historical reports."
      },
      {
        "id": 3,
        "statement": "Implement an IoT environmental monitor to track classroom air quality (CO₂, temperature, humidity) and alert when ventilation is needed.",
        "description": "Build a smart environmental monitoring system that continuously tracks indoor air quality parameters to ensure optimal learning conditions. The system should integrate CO₂ sensors, temperature and humidity sensors, and potentially air quality sensors for PM2.5 and volatile organic compounds. Implement threshold-based alerting that notifies facility management when ventilation is required. Include data logging capabilities, trend analysis, and a dashboard displaying real-time and historical environmental data. Consider integration with HVAC systems for automated ventilation control."
      },
      {
        "id": 4,
        "statement": "Create an IoT-enabled smart irrigation system for a campus garden that uses soil moisture sensors and weather data to water plants automatically.",
        "description": "Develop an intelligent irrigation management system that optimizes water usage while maintaining healthy plant growth. The solution should incorporate soil moisture sensors at multiple depths, weather station integration for rainfall and forecast data, and automated valve control systems. Implement machine learning algorithms to predict irrigation needs based on plant types, seasonal patterns, and environmental conditions. Include water usage tracking, plant health monitoring, and a mobile app for gardeners to monitor system status and override automatic schedules when necessary."
      },
      {
        "id": 5,
        "statement": "Build an IoT wearable device prototype that continuously monitors student health data (e.g. heart rate, body temperature) and sends alerts for anomalies.",
        "description": "Design a health monitoring wearable that tracks vital signs and detects potential health issues before they become critical. The device should monitor heart rate, body temperature, and potentially additional metrics like stress levels or activity patterns. Implement anomaly detection algorithms that can identify unusual patterns and send immediate alerts to users and designated emergency contacts. Include data privacy features, battery optimization for continuous monitoring, and integration with healthcare systems or campus health services for emergency response coordination."
      },
      {
        "id": 6,
        "statement": "Deploy an IoT network of smart waste bins with fill-level sensors to optimize trash collection routes on campus.",
        "description": "Create an intelligent waste management system that revolutionizes campus cleaning operations through data-driven route optimization. Install ultrasonic or load-based sensors in waste bins across campus to monitor fill levels in real-time. Develop algorithms to predict optimal collection schedules and routes based on historical data, current fill levels, and campus activity patterns. Implement a central management system that provides maintenance crews with dynamic route planning, reduces unnecessary collection trips, and ensures bins never overflow. Include analytics for waste generation patterns and sustainability reporting."
      },
      {
        "id": 7,
        "statement": "Establish an IoT energy monitoring system for a household to measure real-time power usage of appliances and suggest energy savings.",
        "description": "Build a comprehensive home energy management system that provides detailed insights into electricity consumption patterns. Deploy smart meters and current sensors on individual appliances and circuits to track real-time power usage. Implement machine learning algorithms to identify energy waste, suggest optimization strategies, and predict monthly bills. Create a user-friendly dashboard showing energy consumption trends, cost analysis, and personalized recommendations for reducing energy usage. Include features for setting energy budgets, receiving high-usage alerts, and comparing efficiency across similar households."
      },
      {
        "id": 8,
        "statement": "Design an IoT streetlight control system that dims or brightens lights based on ambient light and pedestrian/vehicle presence.",
        "description": "Develop an adaptive street lighting system that balances energy efficiency with public safety requirements. Integrate ambient light sensors, motion detectors, and potentially computer vision systems to detect pedestrian and vehicular traffic. Implement dynamic lighting algorithms that adjust brightness levels based on natural light conditions, traffic density, and time of day. Include remote monitoring and control capabilities for maintenance teams, fault detection systems, and energy usage analytics. Consider integration with smart city infrastructure and emergency response systems for enhanced functionality."
      },
      {
        "id": 9,
        "statement": "Develop an IoT-connected pet care system (automatic feeder or tracker) that notifies owners of pet activity or feeding schedules.",
        "description": "Create a comprehensive pet care solution that ensures pet health and provides peace of mind for owners. The system should include automated feeding mechanisms with portion control, activity tracking through GPS or accelerometer sensors, and health monitoring capabilities. Implement scheduling features for regular feeding times, medication reminders, and exercise routines. Develop a mobile application that provides real-time notifications, activity reports, health alerts, and the ability to remotely interact with pets through cameras or treat dispensers. Include integration with veterinary services for health record management."
      },
      {
        "id": 10,
        "statement": "Implement an IoT smart parking solution that detects available parking spots on campus and guides drivers via a mobile app.",
        "description": "Build an intelligent parking management system that reduces traffic congestion and improves parking efficiency on campus. Deploy parking sensors (ultrasonic, magnetic, or camera-based) in individual parking spaces to detect vehicle presence. Create a real-time parking availability map accessible through a mobile application that guides drivers to available spots using optimal routing algorithms. Implement reservation capabilities, payment integration, and parking violation detection. Include analytics for parking usage patterns, peak hour management, and revenue optimization for campus administration."
      }
    ]
  },
  "2nd_year_ee": {
    "title": "Green House Questions",
    "description": "Problem Statements for Students of 2nd Year EE, EEE, ECE and ME Students.",
    "questions": [
      {
        "id": 1,
        "statement": "Design an IoT-based smart electricity meter that wirelessly reports real-time home energy consumption to a cloud dashboard.",
        "description": "Engineer a next-generation smart metering solution that provides granular insights into household electricity consumption. The system should include high-precision current and voltage sensors, power quality monitoring capabilities, and wireless communication modules for data transmission. Implement real-time data processing to calculate instantaneous power, energy consumption, and power factor. Design a cloud-based dashboard that displays consumption patterns, identifies energy-hungry appliances, and provides bill predictions. Include features for demand response programs, time-of-use pricing integration, and automated alerts for unusual consumption patterns or power quality issues."
      },
      {
        "id": 2,
        "statement": "Develop an IoT weather station with sensors (temperature, humidity, pressure, rain) that uploads data online for local forecasting.",
        "description": "Build a comprehensive meteorological monitoring station that contributes to local weather prediction networks. Integrate multiple environmental sensors including temperature and humidity sensors, barometric pressure sensors, rain gauges, and wind speed/direction measurements. Implement data calibration algorithms, sensor fusion techniques, and quality control measures to ensure accurate readings. Design communication systems for reliable data transmission to weather services or cloud platforms. Include local display capabilities, historical data storage, and integration with weather prediction models for hyper-local forecasting that benefits the immediate community."
      },
      {
        "id": 3,
        "statement": "Implement an IoT system to monitor a solar panel array: track voltage/current output and optimize panel tilt via a motor.",
        "description": "Create an intelligent solar energy optimization system that maximizes photovoltaic power generation through real-time monitoring and adaptive positioning. Install voltage and current sensors on individual panels or strings to track power output, efficiency metrics, and detect faulty panels. Implement motor control systems for automatic panel tilt adjustment based on sun tracking algorithms and weather conditions. Design MPPT (Maximum Power Point Tracking) algorithms, performance analytics, and predictive maintenance features. Include weather correlation analysis, shading detection, and integration with home energy management systems for optimal energy utilization."
      },
      {
        "id": 4,
        "statement": "Create an IoT-enabled fire or smoke detection network that alerts homeowners and authorities during a fire emergency.",
        "description": "Develop a comprehensive fire safety system that provides early detection and rapid emergency response coordination. Implement multiple sensor types including smoke detectors, heat sensors, CO detectors, and potentially flame sensors for comprehensive fire detection. Design a mesh network topology for reliable communication even during emergencies, with battery backup systems and redundant communication paths. Create automated alert systems that notify homeowners, neighbors, and emergency services with location-specific information. Include evacuation route guidance, integration with smart home systems for automated responses (unlocking doors, turning on lights), and real-time monitoring dashboards for fire departments."
      },
      {
        "id": 5,
        "statement": "Build an IoT greenhouse control system using sensors for temperature, humidity, and soil moisture, with actuators to automate watering and ventilation.",
        "description": "Engineer a precision agriculture system that creates optimal growing conditions through intelligent environmental control. Integrate multiple sensor arrays for temperature, humidity, soil moisture, light intensity, and CO₂ levels throughout the greenhouse. Implement automated actuator systems including irrigation valves, ventilation fans, heating elements, and potentially LED grow lights. Design control algorithms that maintain optimal growing conditions for specific crops, implement water conservation strategies, and adapt to external weather conditions. Include crop growth monitoring, yield prediction models, and mobile alerts for system status and harvest readiness."
      },
      {
        "id": 6,
        "statement": "Establish an IoT soil-monitoring network for precision agriculture: use moisture and nutrient sensors to optimize irrigation and fertilization.",
        "description": "Create a comprehensive soil health monitoring system that revolutionizes agricultural practices through data-driven farming decisions. Deploy wireless sensor networks throughout agricultural fields to monitor soil moisture at multiple depths, nutrient levels (N-P-K), pH levels, and soil temperature. Implement variable rate irrigation and fertilization systems that respond to real-time soil conditions and crop needs. Design predictive models for optimal planting times, harvest scheduling, and crop rotation planning. Include integration with weather data, satellite imagery analysis, and farm management systems for comprehensive precision agriculture solutions."
      },
      {
        "id": 7,
        "statement": "Design an IoT wearable electronics project (e.g. fitness band) that transmits biometric data (steps, pulse) to a smartphone for tracking.",
        "description": "Develop an advanced wearable health monitoring device that provides comprehensive fitness and wellness tracking capabilities. Engineer miniaturized sensor systems including accelerometers for step counting, heart rate sensors, potentially blood oxygen sensors, and sleep monitoring capabilities. Implement power-efficient wireless communication protocols, battery optimization algorithms, and water-resistant housing design. Create smartphone applications with data visualization, goal setting, health trend analysis, and social features for motivation. Include integration with health platforms, medical record systems, and emergency contact features for health emergencies."
      },
      {
        "id": 8,
        "statement": "Develop an IoT home surveillance system with motion detectors and cameras that sends alerts when intruders are detected.",
        "description": "Build a comprehensive home security solution that provides intelligent threat detection and response capabilities. Integrate multiple sensor types including PIR motion sensors, door/window contacts, glass break detectors, and high-resolution cameras with night vision capabilities. Implement computer vision algorithms for person detection, facial recognition, and behavioral analysis to reduce false alarms. Design mobile alert systems with live video streaming, two-way audio communication, and integration with security services. Include privacy protection features, local storage options, and smart home integration for automated responses to security events."
      },
      {
        "id": 9,
        "statement": "Implement an IoT predictive maintenance system for a simple machine (e.g. motor): use vibration and temperature sensors to detect faults.",
        "description": "Create an intelligent condition monitoring system that prevents equipment failures through early fault detection and predictive analytics. Install vibration sensors, temperature probes, current sensors, and potentially acoustic sensors on motors and rotating machinery. Implement signal processing algorithms to analyze vibration signatures, identify bearing wear, misalignment, and other mechanical faults. Design machine learning models that predict failure modes and remaining useful life based on historical data and current conditions. Include maintenance scheduling optimization, spare parts inventory management, and integration with CMMS (Computerized Maintenance Management Systems) for comprehensive asset management."
      },
      {
        "id": 10,
        "statement": "Create an IoT streetlight power management solution where lights report their status and outages, enabling remote diagnostics.",
        "description": "Engineer a smart streetlight infrastructure management system that reduces maintenance costs and improves public safety through proactive monitoring. Implement power monitoring circuits in each streetlight to track energy consumption, detect failures, and monitor lamp performance degradation. Design wireless communication networks for status reporting, remote control capabilities, and firmware updates. Create centralized management systems that provide real-time infrastructure status, automated fault reporting, and optimized maintenance scheduling. Include energy usage analytics, LED lifespan tracking, and integration with smart city platforms for coordinated infrastructure management and emergency response capabilities."
      }
    ]
  },
  "3rd_year_cse": {
    "title": "Blue House Questions",
    "description": "Problem Statements for Students of 3rd and 4th Year CSE and CSBS Students.",
    "questions": [
      {
        "id": 1,
        "statement": "Design an IoT platform for predictive maintenance in manufacturing: collect sensor data from machines and use analytics to forecast failures.",
        "description": "Develop a comprehensive Industrial IoT platform that revolutionizes manufacturing maintenance through advanced predictive analytics and machine learning. The system should collect real-time data from diverse sensors including vibration, temperature, pressure, current, and acoustic sensors across manufacturing equipment. Implement edge computing solutions for real-time data processing, anomaly detection algorithms, and failure prediction models using techniques like neural networks, time series analysis, and ensemble methods. Design a scalable cloud architecture with data lakes for historical analysis, digital twin modeling for equipment simulation, and maintenance optimization algorithms. Include integration with ERP systems, automated work order generation, spare parts inventory optimization, and ROI tracking for maintenance investments."
      },
      {
        "id": 2,
        "statement": "Develop a smart city traffic management system using IoT traffic sensors and real-time analytics to optimize signal timings and reduce congestion.",
        "description": "Create an intelligent traffic management ecosystem that leverages IoT sensors, computer vision, and AI to optimize urban mobility and reduce congestion. Deploy a network of traffic sensors, cameras, and environmental monitors at intersections and along roadways to collect real-time traffic flow data, vehicle counts, and air quality measurements. Implement machine learning algorithms for traffic pattern analysis, congestion prediction, and adaptive signal control that responds to current conditions. Design integration with public transportation systems, emergency vehicle prioritization, and mobile applications for citizen traffic updates. Include carbon emission tracking, noise pollution monitoring, and economic impact analysis of traffic optimization strategies."
      },
      {
        "id": 3,
        "statement": "Create an IoT-based smart grid solution that balances renewable energy (solar/wind) supply and demand, possibly using blockchain for secure energy transactions.",
        "description": "Engineer an advanced smart grid management platform that integrates renewable energy sources with intelligent demand response and secure energy trading mechanisms. Implement IoT sensors and smart meters throughout the electrical grid to monitor energy production from solar panels and wind turbines, track consumption patterns, and detect grid anomalies. Develop AI algorithms for energy demand forecasting, supply optimization, and grid stability maintenance. Design blockchain-based energy trading systems that enable peer-to-peer energy transactions, automated smart contracts for energy pricing, and secure transaction logging. Include battery storage optimization, electric vehicle charging coordination, and integration with energy markets for dynamic pricing and grid services."
      },
      {
        "id": 4,
        "statement": "Implement a remote patient monitoring system: IoT medical sensors send health data (ECG, glucose) to doctors for real-time analysis.",
        "description": "Develop a comprehensive telemedicine platform that enables continuous patient health monitoring and early intervention through advanced IoT medical devices and AI analytics. Integrate multiple medical sensors including ECG monitors, continuous glucose monitors, blood pressure sensors, pulse oximeters, and potentially wearable devices for activity and sleep tracking. Implement real-time data transmission with medical-grade security and HIPAA compliance, AI algorithms for abnormal pattern detection, and automated alert systems for healthcare providers. Design patient management dashboards for healthcare professionals, mobile applications for patients with medication reminders and health coaching, and integration with electronic health records and hospital systems for seamless care coordination."
      },
      {
        "id": 5,
        "statement": "Build an intelligent waste management system: IoT sensors in bins detect fill levels and compute optimal garbage collection routes.",
        "description": "Create a city-wide smart waste management platform that optimizes collection efficiency, reduces operational costs, and improves urban cleanliness through advanced analytics and route optimization. Deploy IoT sensors in waste bins across the city to monitor fill levels, waste composition, and collection frequency patterns. Implement machine learning algorithms for waste generation prediction, dynamic route optimization based on real-time conditions, and fleet management optimization. Design integration with GIS systems for spatial analysis, mobile applications for collection crews with real-time updates, and citizen reporting platforms for waste-related issues. Include sustainability metrics tracking, recycling rate optimization, and cost-benefit analysis for waste management operations."
      },
      {
        "id": 6,
        "statement": "Develop an IoT-driven agricultural drone: use multispectral imaging and IoT connectivity to monitor crop health and notify farmers of issues.",
        "description": "Engineer an autonomous precision agriculture system that combines drone technology, multispectral imaging, and IoT connectivity to revolutionize crop monitoring and farm management. Integrate multispectral cameras, thermal sensors, and IoT communication systems on agricultural drones for automated crop health assessment. Implement computer vision and machine learning algorithms for disease detection, pest identification, nutrient deficiency analysis, and yield prediction based on NDVI and other vegetation indices. Design automated flight planning systems, weather-aware mission scheduling, and real-time data processing capabilities. Include farmer mobile applications with actionable insights, integration with farm management systems, and precision application recommendations for fertilizers, pesticides, and irrigation."
      },
      {
        "id": 7,
        "statement": "Design a smart parking system: IoT sensors detect vacant spots and guide drivers via an app, integrating with city traffic data.",
        "description": "Develop a comprehensive smart parking ecosystem that reduces urban congestion, improves parking efficiency, and enhances citizen mobility through integrated IoT sensors and intelligent routing systems. Deploy parking sensors throughout the city including on-street spaces, parking garages, and private lots to create a real-time parking availability map. Implement dynamic pricing algorithms based on demand patterns, integration with traffic management systems for optimal routing that considers both parking availability and traffic conditions, and mobile payment systems with reservation capabilities. Design predictive analytics for parking demand forecasting, integration with public transportation systems for multimodal trip planning, and carbon footprint tracking for sustainable urban mobility initiatives."
      },
      {
        "id": 8,
        "statement": "Implement an IoT leak detection network for water pipelines: use pressure and flow sensors to locate and alert on leaks.",
        "description": "Create an intelligent water infrastructure monitoring system that prevents water loss, reduces maintenance costs, and ensures reliable water supply through advanced leak detection and pipeline health monitoring. Deploy pressure sensors, flow meters, acoustic sensors, and water quality monitors throughout the water distribution network to detect leaks, pipe bursts, and water quality issues in real-time. Implement machine learning algorithms for anomaly detection, leak localization using pressure differential analysis, and predictive maintenance based on pipe age, material, and environmental factors. Design integration with GIS systems for spatial analysis, mobile applications for field crews with augmented reality for pipe location, and customer notification systems for service disruptions."
      },
      {
        "id": 9,
        "statement": "Create a smart retail inventory system: use IoT-enabled RFID tags and cloud software to track products from stockroom to shelf.",
        "description": "Develop an end-to-end retail inventory management platform that provides real-time product tracking, automated reordering, and enhanced customer experience through IoT-enabled inventory visibility. Implement RFID tags, smart shelves with weight sensors, and computer vision systems for automated inventory tracking from warehouse to point of sale. Design machine learning algorithms for demand forecasting, dynamic pricing optimization, and supply chain optimization based on real-time inventory data. Include integration with e-commerce platforms, mobile applications for store associates with inventory lookup and customer assistance features, and customer-facing applications for product availability checking and in-store navigation. Develop analytics dashboards for inventory turnover optimization, loss prevention, and supply chain performance monitoring."
      },
      {
        "id": 10,
        "statement": "Develop a connected factory system (Industry 4.0): IoT devices on assembly lines coordinate production flow and report real-time status to managers.",
        "description": "Engineer a comprehensive Industry 4.0 manufacturing platform that transforms traditional production lines into intelligent, self-optimizing systems through advanced IoT integration and AI-driven process optimization. Deploy IoT sensors and actuators throughout assembly lines to monitor production metrics, quality parameters, machine performance, and environmental conditions. Implement digital twin technology for virtual factory modeling, machine learning algorithms for predictive quality control and production optimization, and real-time coordination systems for adaptive manufacturing processes. Design integration with ERP and MES systems, mobile dashboards for floor managers with real-time KPI monitoring, and automated quality assurance systems with computer vision for defect detection. Include supply chain integration for just-in-time manufacturing, energy optimization algorithms, and worker safety monitoring systems."
      }
    ]
  },
  "3rd_year_ee": {
    "title": "Red House Questions",
    "description": "Problem Statements for Students of 3rd and 4th Year EE, EEE, ECE and ME Students.",
    "questions": [
      {
        "id": 1,
        "statement": "Design an IoT-based power grid monitoring system: sensors at substations and transformers track voltage/frequency and report anomalies.",
        "description": "Engineer a comprehensive smart grid monitoring and control system that ensures power quality, grid stability, and rapid fault detection across electrical distribution networks. Deploy advanced sensors at substations and transformers to monitor voltage levels, frequency variations, harmonics, power factor, load currents, and transformer oil temperature. Implement real-time power quality analysis algorithms, fault location systems using traveling wave analysis, and grid stability monitoring with phasor measurement units (PMUs). Design automated protection systems with adaptive relay settings, load forecasting algorithms for optimal power dispatch, and integration with renewable energy sources for grid balancing. Include cybersecurity measures for critical infrastructure protection, emergency response coordination systems, and regulatory compliance monitoring for power quality standards."
      },
      {
        "id": 2,
        "statement": "Develop an IoT precision irrigation system for agriculture: automate valves based on soil moisture, weather forecasts, and plant needs.",
        "description": "Create an intelligent precision irrigation platform that optimizes water usage while maximizing crop yield through advanced sensor networks and predictive algorithms. Implement wireless sensor networks with soil moisture sensors at multiple depths, weather stations, plant health monitoring sensors, and automated valve control systems across agricultural fields. Design machine learning algorithms that consider soil type, crop growth stages, historical weather patterns, and real-time environmental conditions to optimize irrigation scheduling. Include integration with satellite imagery for field mapping, weather API integration for forecast-based irrigation planning, and mobile applications for farmers with remote monitoring and manual override capabilities. Develop water conservation analytics, crop yield optimization models, and economic analysis tools for ROI calculation on irrigation investments."
      },
      {
        "id": 3,
        "statement": "Create a network of IoT-enabled warehouse robots: coordinate their movement and tasks to optimize storage and retrieval.",
        "description": "Develop an autonomous warehouse management system that coordinates multiple robots for efficient inventory handling, storage optimization, and order fulfillment through advanced IoT communication and AI coordination algorithms. Implement autonomous mobile robots (AMRs) with navigation sensors, RFID readers, computer vision systems, and wireless communication capabilities for real-time coordination. Design multi-robot coordination algorithms that optimize task allocation, path planning with collision avoidance, and dynamic load balancing based on warehouse conditions and order priorities. Include integration with warehouse management systems (WMS), real-time inventory tracking, predictive maintenance for robotic systems, and human-robot collaboration protocols for safety. Develop performance analytics for throughput optimization, energy consumption monitoring, and ROI analysis for warehouse automation investments."
      },
      {
        "id": 4,
        "statement": "Implement an IoT drone swarm for environmental mapping: equip drones with air-quality sensors to monitor pollution over a region.",
        "description": "Engineer a coordinated drone swarm system for comprehensive environmental monitoring that provides real-time air quality assessment and pollution source identification across large geographical areas. Equip drones with multi-gas sensors for CO₂, NOx, SO₂, particulate matter (PM2.5/PM10), and volatile organic compounds, along with GPS, weather sensors, and high-resolution cameras for visual documentation. Implement swarm coordination algorithms for efficient area coverage, adaptive flight patterns based on wind conditions and pollution hotspots, and real-time data fusion from multiple drones for accurate pollution mapping. Design automated mission planning systems that consider weather conditions, airspace regulations, and battery management for extended operations. Include integration with environmental agencies, real-time pollution alerts for public health, and predictive modeling for pollution dispersion and source identification."
      },
      {
        "id": 5,
        "statement": "Design a smart building energy management system: IoT sensors and controllers optimize HVAC and lighting using solar panels and battery storage.",
        "description": "Create an intelligent building automation system that achieves optimal energy efficiency through coordinated control of HVAC, lighting, and renewable energy systems with advanced predictive algorithms and occupancy-based optimization. Implement comprehensive sensor networks for occupancy detection, indoor air quality monitoring, temperature and humidity control, and lighting level management. Design energy optimization algorithms that coordinate solar panel output, battery storage systems, and grid interaction for cost minimization and sustainability goals. Include predictive maintenance for building systems, integration with smart grid demand response programs, and machine learning algorithms for occupancy prediction and comfort optimization. Develop building performance analytics, carbon footprint tracking, and automated compliance reporting for green building certifications and energy efficiency standards."
      },
      {
        "id": 6,
        "statement": "Develop a wearable IoT exoskeleton device: monitor muscle activity and adjust actuators to assist human movement (e.g. for rehabilitation).",
        "description": "Engineer an advanced powered exoskeleton system that provides intelligent movement assistance and rehabilitation support through real-time biomechanical monitoring and adaptive control algorithms. Integrate EMG sensors for muscle activity monitoring, inertial measurement units (IMUs) for motion tracking, force sensors for load measurement, and servo actuators for movement assistance at key joints. Implement machine learning algorithms for gait pattern recognition, personalized assistance level adjustment, and rehabilitation progress tracking based on individual patient needs and recovery goals. Design safety systems with emergency stop mechanisms, fall detection and prevention, and real-time health monitoring integration. Include rehabilitation therapy protocols, progress tracking dashboards for healthcare providers, and integration with electronic health records for comprehensive patient care coordination."
      },
      {
        "id": 7,
        "statement": "Create a secure industrial IoT communication protocol: ensure sensor-actuator networks are protected against cyber-attacks in manufacturing.",
        "description": "Develop a robust cybersecurity framework for industrial IoT networks that protects critical manufacturing infrastructure from cyber threats while maintaining real-time performance requirements for industrial control systems. Implement end-to-end encryption protocols optimized for resource-constrained industrial devices, intrusion detection systems specifically designed for industrial network traffic patterns, and secure authentication mechanisms for device onboarding and communication. Design network segmentation strategies that isolate critical control systems, anomaly detection algorithms for identifying unusual network behavior, and automated incident response systems for rapid threat mitigation. Include compliance frameworks for industrial cybersecurity standards (IEC 62443), penetration testing tools for vulnerability assessment, and security monitoring dashboards for plant operations and IT security teams."
      },
      {
        "id": 8,
        "statement": "Implement an IoT structural health monitoring system: deploy accelerometers and strain gauges on bridges/buildings to detect stress and potential failure.",
        "description": "Create a comprehensive structural health monitoring platform that ensures infrastructure safety through continuous monitoring of structural integrity and predictive failure analysis using advanced sensor networks and AI algorithms. Deploy wireless sensor networks with accelerometers, strain gauges, tilt sensors, and environmental sensors throughout bridge and building structures to monitor structural responses to loads, environmental conditions, and natural events. Implement signal processing algorithms for modal analysis, damage detection using vibration signature changes, and fatigue analysis based on stress cycles. Design predictive models for remaining useful life estimation, automated alert systems for critical structural conditions, and integration with emergency response systems for public safety. Include regulatory compliance monitoring, maintenance scheduling optimization, and cost-benefit analysis for infrastructure investment decisions."
      },
      {
        "id": 9,
        "statement": "Design an IoT power quality analyzer: continuous monitoring of harmonics and transients on an electrical network with automated reporting.",
        "description": "Engineer a comprehensive power quality monitoring and analysis system that ensures electrical network reliability and compliance with power quality standards through real-time monitoring and automated reporting capabilities. Implement high-resolution power quality meters with capabilities for harmonic analysis, voltage sag/swell detection, flicker measurement, and transient capture throughout electrical distribution systems. Design advanced signal processing algorithms for power quality event classification, root cause analysis of power disturbances, and correlation analysis between multiple monitoring points. Include automated reporting systems for regulatory compliance (IEEE 519, IEC 61000), integration with SCADA systems for real-time power system monitoring, and mobile applications for field engineers with power quality event notifications. Develop economic analysis tools for power quality improvement investments and integration with smart grid systems for coordinated power quality management."
      },
      {
        "id": 10,
        "statement": "Develop an IoT-based electric vehicle diagnostic tool: track battery health, charging status, and usage patterns via onboard sensors.",
        "description": "Create an intelligent electric vehicle (EV) health monitoring and diagnostic system that provides comprehensive battery management, predictive maintenance, and performance optimization through advanced onboard sensing and cloud analytics. Implement battery management systems with individual cell monitoring, thermal management sensors, current and voltage measurement systems, and motor performance monitoring for electric drivetrains. Design machine learning algorithms for battery state-of-health estimation, remaining useful life prediction, and charging optimization based on usage patterns and environmental conditions. Include integration with charging infrastructure for smart charging coordination, mobile applications for drivers with vehicle health reports and maintenance recommendations, and fleet management capabilities for commercial EV operations. Develop predictive maintenance algorithms for electric drivetrain components, energy efficiency optimization recommendations, and integration with smart grid systems for vehicle-to-grid (V2G) applications."
      }
    ]
  }
}
